In [ ]:
%matplotlib inline
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import pandas as pd
from IPython.display import display
from IPython.display import Image
sns.set_context("notebook")

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

# Extracting Data and Filtering
:The `[]` operator supports array of booleans as an input. In this case, the array must be exactly as long as the number of rows.

The result is a **filtered version of the data frame**, where **only rows corresponding to True appear**.

# Q1.
Select multiple criteria by creating multiple boolean Series and combining them using the `&` operator. For Examole Result is win and %win is more than 50.

In [35]:
import pandas as pd
election = pd.read_csv(r'C:\Users\pc\Desktop\Data Science with ML\pandas\elections.csv')
 # if we end a cell with an expression or variable name, the result will print the data frame
e1=(election["Result"]== "win")  & (election["%"]>50 )

print(election[e1])

#condition = (election["Result"] == "win") & (election["%"] > 50)

# Apply the combined condition to filter the dataframe
#e3 = election[condition]
#print(e3)

   Candidate       Party     %  Year Result
0     Reagan  Republican  50.7  1980    win
3     Reagan  Republican  58.8  1984    win
5       Bush  Republican  53.4  1988    win
16      Bush  Republican  50.7  2004    win
17     Obama  Democratic  52.9  2008    win
19     Obama  Democratic  51.1  2012    win

We will nowe work with a dataset containing the names of all babies born in California, USA. Visit the [Social Security Adminisitration Website](https://www.ssa.gov/oact/babynames/limits.html) for more details about the dataset if you want.

**Let's start by loading the Baby Names dataset.**

In [2]:
import urllib.request
import os.path
import zipfile
import pandas as pd

data_url = "https://www.ssa.gov/oact/babynames/state/namesbystate.zip"
local_filename = "babynamesbystate.zip"
if not os.path.exists(local_filename): # if the data exists don't download again
    with urllib.request.urlopen(data_url) as resp, open(local_filename, 'wb') as f:
        f.write(resp.read())

zf = zipfile.ZipFile(local_filename, 'r')

ca_name = 'STATE.CA.TXT'
field_names = ['State', 'Sex', 'Year', 'Name', 'Count']
with zf.open(ca_name) as fh:
    babynames = pd.read_csv(fh, header=None, names=field_names)

babynames.head(15)

   State Sex  Year       Name  Count
0     CA   F  1910       Mary    295
1     CA   F  1910      Helen    239
2     CA   F  1910    Dorothy    220
3     CA   F  1910   Margaret    163
4     CA   F  1910    Frances    134
5     CA   F  1910       Ruth    128
6     CA   F  1910     Evelyn    126
7     CA   F  1910      Alice    118
8     CA   F  1910   Virginia    101
9     CA   F  1910  Elizabeth     93
10    CA   F  1910   Florence     93
11    CA   F  1910      Marie     90
12    CA   F  1910    Mildred     90
13    CA   F  1910       Rose     74
14    CA   F  1910      Hazel     68

# Q2.
Calculate the some statics of babynames DataFrame using Utility Functions, like .describe(), .size(), .shape() and report your analysis in comments

In [40]:
c1=babynames
c1.describe()

                Year          Count
count  407428.000000  407428.000000
mean     1985.733609      79.543456
std        27.007660     293.698654
min      1910.000000       5.000000
25%      1969.000000       7.000000
50%      1992.000000      13.000000
75%      2008.000000      38.000000
max      2022.000000    8260.000000

In [5]:
print(babynames.shape)
babynames.size

(407428, 5)

2037140

# Q.3:

Using the babynames DataFrame that contains baby names data for the state of California, how can you use the 'isin' method to find out which records have names that are in a given list of names, such as "Emma," "Liam," and "Olivia," and what would be the output of this operation when applied to the first 15 rows of the DataFrame (babynames.head(15))?

In [24]:
# List of names to check
name_list = ["Emma", "Liam", "Olivia"]
#babynames[babynames.head(15).isin("name_list")]
Conditioned_names = babynames[babynames["Name"].isin(name_list)]
filtered_babynames=Conditioned_names.head(15)
print(filtered_babynames)
# Use the isin method to filter records with names in the name_list


# Display the filtered DataFrame

     State Sex  Year    Name  Count
53      CA   F  1910    Emma     29
293     CA   F  1911    Emma     29
525     CA   F  1912    Emma     56
701     CA   F  1912  Olivia      8
840     CA   F  1913    Emma     56
1168    CA   F  1914    Emma     65
1437    CA   F  1914  Olivia      6
1542    CA   F  1915    Emma     86
1869    CA   F  1915  Olivia      6
2009    CA   F  1916    Emma     78
2195    CA   F  1916  Olivia     12
2467    CA   F  1917    Emma     95
2639    CA   F  1917  Olivia     15
2958    CA   F  1918    Emma     83
3136    CA   F  1918  Olivia     15

# Q.4:
How can you use the 'str.startswith' method in pandas to filter records in a babyname DataFrame? Provide an example code using the babynames DataFrame and explain how this method can be employed to extract data for baby names that begin with 'A' or 'B' set of letters.

In [8]:
# Filter rows where the 'Name' column starts with 'A'

# Display the filtered DataFrame

#babynames.strstartswith("A")

A_lett=babynames[babynames["Name"].str.startswith("A")]
B_lett=babynames[babynames["Name"].str.startswith("B")]
AB_Lett=pd.concat([A_lett , B_lett])
AB_Lett

       State Sex  Year     Name  Count
7         CA   F  1910    Alice    118
31        CA   F  1910     Anna     51
32        CA   F  1910      Ann     47
57        CA   F  1910    Anita     28
68        CA   F  1910     Alma     24
...      ...  ..   ...      ...    ...
407125    CA   M  2022   Brando      5
407126    CA   M  2022  Braxtyn      5
407127    CA   M  2022  Brenden      5
407128    CA   M  2022     Brix      5
407129    CA   M  2022    Broly      5

[61691 rows x 5 columns]

# Q.5

Find the most popular baby name in California in 2012

__Exercise__: Try to find the most popular baby name by finding the maximum value for 'Count' and then apply filtering to find the name.

In [107]:
#filtered= babynames[babynames["Count"].max]
#m1=c1=babynames['Name']==max(babynames['Name'].value_counts())
#babynames[m1]

m2=(babynames['Year']==2012) &(babynames['State']=="CA") 
maxi=babynames[m2]


# Filter the dataframe to find the row(s) with this maximum 'Count'
tb =maxi.sort_values(by='Count', ascending=False)
print(tb)



# Display the most popular name and its count
print(tb.iloc[0])

most_popular = tb.iloc[0]
print(f"The most popular Baby name is {most_popular.Name} with a count of {most_popular['Count']}.")

       State Sex  Year      Name  Count      8260  Lenght  Lenght
197530    CA   F  2012    Sophia   3644    Sophia       6       6
197531    CA   F  2012  Isabella   3113  Isabella       8       8
375622    CA   M  2012     Jacob   2982     Jacob       5       5
375623    CA   M  2012    Jayden   2871    Jayden       6       6
375624    CA   M  2012    Daniel   2689    Daniel       6       6
...      ...  ..   ...       ...    ...       ...     ...     ...
201245    CA   F  2012      Elsi      5      Elsi       4       4
201244    CA   F  2012    Ellora      5    Ellora       6       6
201243    CA   F  2012  Elliotte      5  Elliotte       8       8
201242    CA   F  2012   Elleana      5   Elleana       7       7
378535    CA   M  2012      Zyon      5      Zyon       4       4

[7017 rows x 8 columns]
State         CA
Sex            F
Year        2012
Name      Sophia
Count       3644
8260      Sophia
Lenght         6
Lenght         6
Name: 197530, dtype: object
The most popular Baby name is Sophia with a count of 3644.

# Q. 6
Find baby names that start with J, in th Year from 2001 to 2019

*Note: To answer this question, we need a way to look at the individual characters of the baby names*

In [62]:
# Note: Series has powerful string manipulation methods associated with it
fir= (babynames['Name'].str.startswith('J')) & (babynames['Year']>=2001) & (babynames['Year']<=2019)
print(babynames[fir])

       State Sex  Year         Name  Count         8260
152826    CA   F  2001      Jessica   2244      Jessica
152828    CA   F  2001     Jennifer   2027     Jennifer
152832    CA   F  2001      Jasmine   1655      Jasmine
152847    CA   F  2001   Jacqueline   1195   Jacqueline
152857    CA   F  2001        Julia    983        Julia
...      ...  ..   ...          ...    ...          ...
398685    CA   M  2019  Joseantonio      5  Joseantonio
398686    CA   M  2019       Jovian      5       Jovian
398687    CA   M  2019       Jujhar      5       Jujhar
398688    CA   M  2019      Jullian      5      Jullian
398689    CA   M  2019         June      5         June

[11276 rows x 6 columns]

# Q.7
Add a new column called "name_length" to the babynames DataFrame, you can use .str.len() in existing Name column. Moreover. also modify the Length values with new values like existing_value-1 and rename the length column with new label as desceribe in slides.

In [69]:
# Calculate the length of each name and add it as a new column "_length"
len=babynames['Name'].str.len()
babynames['Name_Lenght']=len

# Display the updated DataFrame
babynames['Name_Lenght']
babynames
# Rename the "_length" column to "Length"
babynames=babynames.rename(columns={"Name_Lenght":"Lenght"})
babynames

       State Sex  Year      Name  Count      8260  Lenght  Lenght
0         CA   F  1910      Mary    295      Mary       4       4
1         CA   F  1910     Helen    239     Helen       5       5
2         CA   F  1910   Dorothy    220   Dorothy       7       7
3         CA   F  1910  Margaret    163  Margaret       8       8
4         CA   F  1910   Frances    134   Frances       7       7
...      ...  ..   ...       ...    ...       ...     ...     ...
407423    CA   M  2022   Zayvier      5   Zayvier       7       7
407424    CA   M  2022       Zia      5       Zia       3       3
407425    CA   M  2022      Zora      5      Zora       4       4
407426    CA   M  2022    Zuriel      5    Zuriel       6       6
407427    CA   M  2022      Zylo      5      Zylo       4       4

[407428 rows x 8 columns]

# Q.8

Use .str.contain() to sample the names with 'ad' string and show first 10 samples.

In [76]:
names_with_ad = babynames[babynames['Name'].str.contains('ad')]
first_10_samples = names_with_ad.head(10)
print(first_10_samples)

    State Sex  Year      Name  Count      8260  Lenght  Lenght
19     CA   F  1910    Gladys     63    Gladys       6       6
96     CA   F  1910  Madeline     17  Madeline       8       8
136    CA   F  1910     Sadie     10     Sadie       5       5
257    CA   F  1911    Gladys     61    Gladys       6       6
346    CA   F  1911    Nadine     14    Nadine       6       6
376    CA   F  1911  Madeline     11  Madeline       8       8
472    CA   F  1911     Madge      5     Madge       5       5
480    CA   F  1911     Sadie      5     Sadie       5       5
506    CA   F  1912    Gladys     87    Gladys       6       6
569    CA   F  1912  Madeline     31  Madeline       8       8

More on str methods when we'll study regular expressions in this course. Note that there are other approaches that we can use to find the same answer as above.

In [97]:
# Create a boolean mask for rows containing 'ad' in the "Name" column
name_ad = babynames['Name'].str.contains('ad')
# Use the mask to select rows and sample 5 random rows
sampled_rows = babynames[name_ad].sample(5)
print(sampled_rows)

       State Sex  Year       Name  Count       8260  Lenght  Lenght
27688     CA   F  1950  Guadalupe    121  Guadalupe       9       9
266413    CA   M  1955       Chad     25       Chad       4       4
228854    CA   F  2020  Madeleine    115  Madeleine       9       9
344395    CA   M  2000    Bradlee      6    Bradlee       7       7
268159    CA   M  1957       Brad    289       Brad       4       4

# Q.9
 Sort names by their length.

In the babynames DataFrame, which baby name appears most frequently across all years and states, and how can you use pandas to find this information? Provide the code and steps to determine the most popular baby name in the dataset.

In [94]:


# Group the data by "Name" and sum the "Count" for each name

gp=babynames.groupby("Name")[["Count"]].agg("sum")
#print(gp)

# Find the name with the highest total count
max(gp)
tb = gp.sort_values(by='Count', ascending=False)
print(tb)



# Display the most popular name and its count
print(tb.iloc[0])

most_popular = tb.iloc[0]
print(f"The most popular name is {most_popular.name} with a count of {most_popular['Count']}.")

           Count
Name
Michael   435716
David     377672
Robert    353511
John      316627
James     286322
...          ...
Lurline        5
Lunarose       5
Lunah          5
Luma           5
Zyrus          5

[20437 rows x 1 columns]
Count    435716
Name: Michael, dtype: int64
The most popular name is Michael with a count of 435716.

# Q.10

1: How can you use the .sample() method to randomly select a single row from the babynames DataFrame, and what is the purpose of such a selection?

2: Suppose you want to generate a random sample of 10 baby names from the babynames DataFrame. How would you use the .sample() method to achieve this, and what parameters or arguments would you specify?

3: In a scenario where you need to ensure reproducibility, explain how you can set a random seed when using the .sample() method in pandas. Why might this be important in certain data analysis tasks?

4: You want to perform a bootstrap resampling analysis on the baby names data in the babynames DataFrame. Describe how you can repeatedly sample with replacement using .sample() to create multiple bootstrap samples for statistical analysis

In [79]:
#2
babynames['Name'].sample(10)

#3
random_seed = 42
sampled_names = babynames['Name'].sample(10, random_state=random_seed)
print(sampled_names)
# 4th Part
# Assuming you have the 'babynames' DataFrame

# Set the random seed for reproducibility

# Number of bootstrap samples

# Sample size (same as the original dataset)

# Initialize a list to store bootstrap sample statistics

# Perform bootstrapping

    # Generate a bootstrap sample with replacement

    # Perform your statistical analysis on the bootstrap sample here
    # For example, you can calculate the mean, median, or other statistics

    # Append the statistic of interest to the list
import pandas as pd

# Assuming 'babynames' is your DataFrame and 'Name' is a column in it.
# Number of bootstrap samples you want to create
num_samples = 1000

# List to store each bootstrap sample
bootstrap_samples = []

for _ in range(num_samples):
    # Sample with replacement the same number of instances as in the original data
    sample = babynames.sample(n=len(babynames), replace=True)
    # Append the sample to the list of bootstrap samples
    bootstrap_samples.append(sample)

# Now you can calculate statistics on each bootstrap sample
# For example, to calculate the mean 'Count' for each sample:
mean_counts = [sample['Count'].mean() for sample in bootstrap_samples]

# To calculate the 95% confidence interval for the mean 'Count':
lower_bound = np.percentile(mean_counts, 2.5)
upper_bound = np.percentile(mean_counts, 97.5)

print(f"95% confidence interval for the mean 'Count': {lower_bound} - {upper_bound}")

254345       Ivan
2739      Rebecca
82669     Candyce
34920        Lani
344907      Sabin
383240        Jin
393129     Winson
136693       Amal
80915      Audrey
181373      Arely
Name: Name, dtype: object

TypeError: 'Series' object is not callable

# Q.11
1: The code randomly mixes up the list of baby names. Why might someone want to do this, and how could it affect the analysis of the names?

2: After mixing, the code figures out how long each baby name is. Why would we care about name lengths, and what can this tell us about the names?

3: The code arranges the name lengths from longest to shortest. Why might we want to do this, and what could it help us find in the data?

4: The code finds the order of baby names based on their lengths and shows us the first few names in this new order. When might we need to organize names this way, and what might we discover from the first few names in this order?

In [ ]:
#Part1, shuffling can be done using sample(frac=1)

#Randomly shuffling or mixing up a list of baby names can be useful for several reasons in data analysis:

#Removing Bias: If the data is in a particular order (e.g., sorted alphabetically or by popularity), 
#randomizing the order can help prevent any bias that might arise from processing the data in that specific order.
#Sampling: When taking a sample from a dataset, it’s important that the sample is representative of the whole.
# Randomizing the list before sampling can help ensure that the sample is not skewed by any ordering in the data.

#Part2

#Analyzing name lengths can reveal cultural trends and preferences in naming conventions. 
#It may also indicate shifts in societal attitudes towards simplicity or complexity in names over time.

#Part3

#Sorting names from longest to shortest can help identify naming patterns and outliers, 
#and it may also facilitate statistical analysis related to name length trends.


#Part4
#Organizing names by length can help in identifying naming trends and preferences, 
#and the first few names could highlight the most common lengths or popular long names.